In [4]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
# Load in csv

student_data_to_load = "Resources/new_full_student_data.csv"
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [ ]:
student_data_df=student_data_df.dropna()
student_data_df.isnull().sum()

In [66]:
student_data_df.duplicated()
student_data_df.drop_duplicates()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9th,Montgomery High School,63.5,76.9,Charter,893368
...,...,...,...,...,...,...,...,...
19508,83985333,Deborah Sanders,10th,Silva High School,60.5,64.6,Public,991918
19509,109236636,Robert Sawyer,12th,Silva High School,43.3,27.2,Public,991918
19511,95516554,Megan Gill,11th,Wagner High School,93.9,84.1,Public,846745
19512,65050383,Lori Stone,11th,Bowers High School,94.6,70.9,Public,848324
19513,34720657,Anna Jensen,12th,Montgomery High School,82.3,42.4,Charter,893368

In [67]:
student_data_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [68]:
student_data_df["grade"] = student_data_df["grade"].str.replace("th","")

In [69]:
student_data_df["grade"]

0         9
1         9
2         9
3         9
5         9
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 16667, dtype: object

In [70]:
student_data_df["grade"] =student_data_df["grade"].astype('int64')

In [71]:
student_data_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [72]:
student_data_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.666700e+04  16667.000000   16667.000000  16667.000000   16667.000000
mean   6.983096e+07     10.354053      72.395068     64.589560  893784.963581
std    3.453505e+07      1.098031      15.224093     15.816358   53963.679617
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.990829e+07      9.000000      62.300000     54.300000  846745.000000
50%    6.977253e+07     10.000000      73.800000     65.200000  893368.000000
75%    9.938019e+07     11.000000      84.000000     75.900000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [73]:
mean_math_score= student_data_df["math_score"].mean()

In [74]:
mean_math_score

64.58956020879589

In [75]:
min_reading_score=student_data_df["reading_score"].min()

In [76]:
print(student_data_df.loc[:,"grade"])

0         9
1         9
2         9
3         9
5         9
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 16667, dtype: int64

In [77]:
student_data_df.iloc[:,2:5].head(3)

   grade           school_name  reading_score
0      9  Sullivan High School           59.0
1      9     Dixon High School           94.7
2      9    Wagner High School           89.0

In [128]:
student_data_df.loc[student_data_df["grade"]==9].describe().round(2)

         student_id   grade  reading_score  math_score  school_budget
count  4.651000e+03  4651.0        4651.00     4651.00        4651.00
mean   6.989824e+07     9.0          69.22       66.47      898677.41
std    3.471276e+07     0.0          15.34       16.67       54794.76
min    1.000906e+07     9.0          17.90        5.30      817615.00
25%    3.987328e+07     9.0          59.00       55.90      846745.00
50%    7.017398e+07     9.0          70.10       67.60      893368.00
75%    9.959880e+07     9.0          80.60       78.40      957299.00
max    1.299997e+08     9.0          99.90      100.00      991918.00

In [79]:
min_reading_row = student_data_df.loc[student_data_df["reading_score"] == min_reading_score]

In [80]:
print(min_reading_row)

      student_id    student_name  grade        school_name  reading_score  \
3706    81758630  Matthew Thomas     10  Dixon High School           10.5

      math_score school_type  school_budget
3706        58.4     Charter         870334

In [110]:
dixon_10th_reading_scores = student_data_df.loc[(student_data_df["grade"] == 10) & (student_data_df["school_name"] == "Dixon High School")]

In [116]:
print(dixon_10th_reading_scores.loc[:,"school_name":"reading_score"])

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[635 rows x 2 columns]

In [113]:
mean_reading_score = student_data_df.loc[(student_data_df["grade"] == 11) | (student_data_df["grade"] == 12), "reading_score"].mean()

In [114]:
print(mean_reading_score)

74.97740016992344

In [127]:
student_data_df.groupby(["school_type"])["school_budget"].mean().round(2)

school_type
Charter    872678.18
Public     911268.21
Name: school_budget, dtype: float64

In [118]:
student_data_df.groupby(["school_name"])["student_id"].count().sort_values(ascending = False)

school_name
Montgomery High School    2295
Green High School         2211
Dixon High School         1776
Wagner High School        1721
Silva High School         1248
Woods High School         1191
Sullivan High School      1079
Turner High School         961
Fisher High School         906
Bowers High School         888
Richard High School        615
Campos High School         604
Odonnell High School       518
Campbell High School       464
Chang High School          190
Name: student_id, dtype: int64

In [129]:
student_data_df.groupby(["school_type","grade"])["math_score"].mean().round(2)

school_type  grade
Charter      9        70.04
             10       66.40
             11       67.83
             12       59.83
Public       9        63.61
             10       63.86
             11       59.22
             12       63.49
Name: math_score, dtype: float64